#!/bin/bash
# 在指定IP的服务器集群中批量执行1个或多个命令（分号隔开）
#
# 参数：
#	参数1：执行的1条或条命令（分号隔开）,例如：pwd;rm file;cd dir
#	参数2：以谁的身份执行，例如 root,Ove

# 检查参数
if [ $# -lt 2 ]; then
	echo "请输入俩个参数!"
	echo "参数1：执行的1条或条命令（分号隔开）,例如：pwd;rm file;cd dir"
	echo "参数2：以谁的身份执行，例如 root,Ove"
	exit 1
fi

# 外网IP
outer_ips=(
159.226.50.41
159.226.50.42
159.226.50.43
159.226.50.44
159.226.50.47
159.226.50.48
159.226.50.49
159.226.50.50
159.226.50.51
159.226.50.52
159.226.50.54
159.226.50.55
159.226.50.57
)

# 内网ip
inner_ips=(
192.168.0.1
192.168.0.2
192.168.0.3
192.168.0.4
192.168.0.7
192.168.0.8
192.168.0.9
192.168.0.10
192.168.0.11
192.168.0.12
192.168.0.14
192.168.0.15
192.168.0.16
)
# 依次为每一台服务器执行命令
for no in {0..12}
do
        # 执行脚本
        ssh $2@${outer_ips[$no]} "$1"
        # 显示是否成功
        if [ $? -eq 0 ]; then
                echo "##### SUCESS! [${outer_ips[$no]}][${inner_ips[$no]}] $1 #####"
        else
                echo "##### FAILURE! [${outer_ips[$no]}][${inner_ips[$no]}] $1 #####"
        fi
done

