#!/bin/bash
# 在指定IP的服务器集群中批量执行1个脚本文件
#
# 参数：
#	参数1：执行的脚本文件名（必须在当前目录下）
#	参数2：以谁的身份执行，例如 root,Ove

# 检查参数
if [ $# -lt 2 ]; then
	echo "请输入俩个参数!"
	echo "参数1：执行的脚本文件路径"
	echo "参数2：以谁的身份执行，例如 root,Ove"
	exit 1
fi

# 外网IP
outer_ips=(
#159.226.50.41
159.226.50.42
159.226.50.43
159.226.50.44
159.226.50.47
159.226.50.48
159.226.50.49
#159.226.50.50
#159.226.50.51
#159.226.50.52
#159.226.50.54
#159.226.50.55
#159.226.50.57
)

# 内网ip
inner_ips=(
#192.168.0.1
192.168.0.2
192.168.0.3
192.168.0.4
192.168.0.7
192.168.0.8
192.168.0.9
#192.168.0.10
#192.168.0.11
#192.168.0.12
#192.168.0.14
#192.168.0.15
#192.168.0.16
)
# 将脚本拷贝到每一台服务器，依次为每一台服务器执行脚本，删除脚本文件
for no in {0..5}
do
	# 拷贝到远程目录中
        scp $1 $2@${outer_ips[$no]}:~
        # 执行脚本,完成后并并删除
        ssh $2@${outer_ips[$no]} "sh ~/$1 && rm -f ~/$1"
        # 显示是否成功
        if [ $? -eq 0 ]; then
                echo "##### SUCESS! [${outer_ips[$no]}][${inner_ips[$no]}] $1 #####"
        else
                echo "##### FAILURE! [${outer_ips[$no]}][${inner_ips[$no]}] $1 #####"
        fi
done

